Public Member Functions | Friends | List of all members
ACAPI::MEP::AccessoryUIManager Class Referencefinal
MEP Element Manager
The AccessoryUIManager contains UI-related services for an Accessory. More...
#include <MEPAccessoryUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::AccessoryUIManager:
 Public Member Functions
Result< AccessoryDefault >  | CreateAccessoryDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a AccessoryDefault from a toolUIData.
Result< void >  | ApplyAccessoryDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const AccessoryDefault &accessoryDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< AccessoryUIManager >  | CreateAccessoryUIManager ()
Creates a AccessoryUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The AccessoryUIManager contains UI-related services for an Accessory.
Since
Archicad 28
Member Function Documentation
◆ ApplyAccessoryDefaultToToolUIData()
 Result< void > ACAPI::MEP::AccessoryUIManager::ApplyAccessoryDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const AccessoryDefault & |  accessoryDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
accessoryDefault | The default to be set
Returns
Returns error if the AccessoryDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateAccessoryDefaultFromToolUIData()
 Result< AccessoryDefault > ACAPI::MEP::AccessoryUIManager::CreateAccessoryDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a AccessoryDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the Accessory in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an AccessoryDefault, otherwise returns the AccessoryDefault created from it.
Friends And Related Symbol Documentation
◆ CreateAccessoryUIManager
 Result< AccessoryUIManager > CreateAccessoryUIManager  |  ( |   | )
friend
Creates a AccessoryUIManager.
Returns
If able, creates a new manager for Accessory, otherwise Error.